Процедура Обработать_obj_logs() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	witsml_obj_logs_xml.GUID КАК GUID,
		|	witsml_obj_logs_xml.xml_пакет КАК xml_пакет
		|ИЗ
		|	РегистрСведений.witsml_obj_logs_xml КАК witsml_obj_logs_xml
		|ГДЕ
		|	НЕ witsml_obj_logs_xml.Обработан";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Начинаем транзакцию
		НачатьТранзакцию();

		СтрокаXML = Выборка.xml_пакет;

		ЧтениеXML = Новый ЧтениеXML;
		
		ЧтениеXML.УстановитьСтроку(СтрокаXML);       
		ЧтениеXML.Прочитать();
		
		URIПространстваИмен = ЧтениеXML.URIПространстваИмен;	
		
		ТипФабрики = ФабрикаXDTO.Тип(URIПространстваИмен, "obj_logs");
		
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипФабрики);
		ЧтениеXML.Закрыть();
		
		witsml_Parsing.Обработать_obj_logs(ОбъектXDTO, Выборка.GUID);
		
		//Завершаем транзакцию
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;  // Пока Выборка.Следующий() Цикл
	
	
КонецПроцедуры  // Обработать_obj_logs() Экспор