
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс) Тогда
		КомплексныйПроцессОбъект = ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс.ПолучитьОбъект();
		
		СтрокаПроцесса = КомплексныйПроцессОбъект.Этапы.Найти(ЭтотОбъект.БизнесПроцесс, "ЗапущенныйБизнесПроцесс");
		
		Если ЗначениеЗаполнено(СтрокаПроцесса) Тогда
		
			ЭтотОбъект.Исполнитель = СтрокаПроцесса.ОтветственныйИсполнитель;
		КонецЕсли;
	КонецЕсли;
		
		
	
	ЭтотОбъект.ДатаНачалаПлановая    = ЭтотОбъект.БизнесПроцесс.ДатаНачалаПлановая;
	ЭтотОбъект.ДатаОкончанияПлановая = ЭтотОбъект.БизнесПроцесс.ДатаОкончанияПлановая;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаНачалаФактическая) Тогда
		ЭтотОбъект.ДатаНачалаФактическая = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаОкончанияФактическая) И ЭтотОбъект.Выполнена Тогда
		ЭтотОбъект.ДатаОкончанияФактическая = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)

	Если ТипЗнч(ЭтотОбъект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.БизнесПроцесс") Тогда
		
		ЭтотОбъект.ДатаОкончанияФактическая = ТекущаяДата();
		
		ТекущийБизнесПроцесс = ЭтотОбъект.БизнесПроцесс.ПолучитьОбъект();
		ТекущийБизнесПроцесс.ЗадачаВыполнена = Истина;
		ТекущийБизнесПроцесс.ДатаНачалаФактическая    = ЭтотОбъект.ДатаНачалаФактическая;
		ТекущийБизнесПроцесс.ДатаОкончанияФактическая = ЭтотОбъект.ДатаОкончанияФактическая;
		ТекущийБизнесПроцесс.Записать();
		
		КомплексныйПроцессОбъект = ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс.ПолучитьОбъект();

		ТочкаМаршрутаВложенныйПроцесс = БизнесПроцессы.БизнесСобытия.ТочкиМаршрута.ВложенныйПроцесс;
		
		НовыеПроцессы = Новый Массив();
		КомплексныйПроцессОбъект.СтартоватьНовыеДействия(
			НовыеПроцессы, 
			ТочкаМаршрутаВложенныйПроцесс, 
			Истина, 
			ЭтотОбъект.БизнесПроцесс);
			
	Иначе
			
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс) Тогда
		КомплексныйПроцессОбъект = ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс.ПолучитьОбъект();
		
		СтрокаПроцесса = КомплексныйПроцессОбъект.Этапы.Найти(ЭтотОбъект.БизнесПроцесс, "ЗапущенныйБизнесПроцесс");
		
		Если ЗначениеЗаполнено(СтрокаПроцесса) Тогда
			
			
			СтрокаПроцесса.ДатаНачалаФактическая    = ЭтотОбъект.ДатаНачалаФактическая;
			СтрокаПроцесса.ДатаОкончанияФактическая = ЭтотОбъект.ДатаОкончанияФактическая;
			СтрокаПроцесса.ЗадачаВыполнена          = ЭтотОбъект.Выполнена;
			
			КомплексныйПроцессОбъект.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
