
&НаСервере
Процедура witsml_Обработать_obj_logsНаСервере()
	
	РегистрыСведений.witsml_obj_logs_xml.Обработать_obj_logs();
	
КонецПроцедуры  // witsml_Обработать_obj_logsНаСервере()  

&НаКлиенте
Процедура witsml_Обработать_obj_logs(Команда)
	
	witsml_Обработать_obj_logsНаСервере();
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.witsml_obj_logs_xml"));
	
КонецПроцедуры  // witsml_Обработать_obj_logs(Команда)

&НаСервере
Процедура ЗапросДанныхСWITSMLСервераНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДанныхСWITSMLСервера(Команда)
	ЗапросДанныхСWITSMLСервераНаСервере();
КонецПроцедуры
