
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)      
	ПользовательИБ =ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	Если ПользовательИБ= Неопределено тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.ПолноеИмя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.Пароль = ТекущийОбъект.Пароль;      
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(Роль));
		ПользовательИБ.Записать();
		ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	Иначе	
		
		ПользовательИБ.Имя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.ПолноеИмя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.Пароль = ТекущийОбъект.Пароль;       
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(Роль));
		ПользовательИБ.Записать();
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПользовательИБ =ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	Элементы.Роль.СписокВыбора.Очистить();
	Для каждого стр из Метаданные.Роли цикл
		Элементы.Роль.СписокВыбора.Добавить(стр.Имя);
		Если ПользовательИБ<>Неопределено и ПользовательИБ.Роли.Содержит(стр) тогда 
			Роль = стр.имя;
		КонецЕсли;	
	КонецЦикла;	  
		
КонецПроцедуры
