
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)  
	УстановитьПривилегированныйРежим(Истина);
	ТекущийПользовательИБ =	ПользователиИнформационнойБазы.ТекущийПользователь();	   
	Если ТекущийПользовательИБ.ПолноеИмя="Администратор" тогда                                                                                                 
		СсылкаСправочникаПользователи = Справочники.Пользователи.ПолучитьСсылку(ТекущийПользовательИБ.УникальныйИдентификатор);
	Иначе	
		СсылкаСправочникаПользователи = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",ТекущийПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СсылкаСправочникаПользователи) Тогда  
		ОбъектСправочникаПользователи = СсылкаСправочникаПользователи.ПолучитьОбъект();  
	Иначе 
		ОбъектСправочникаПользователи = Справочники.Пользователи.СоздатьЭлемент();  
	КонецЕсли;
	
	Если ОбъектСправочникаПользователи = Неопределено Тогда 
		ОбъектСправочникаПользователи = Справочники.Пользователи.СоздатьЭлемент();
		ОбъектСправочникаПользователи.УстановитьСсылкуНового(СсылкаСправочникаПользователи);
		ОбъектСправочникаПользователи.Наименование = ТекущийПользовательИБ.Имя;
		ОбъектСправочникаПользователи.Записать();
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = СсылкаСправочникаПользователи; 
	ПараметрыСеанса.СотрудникКонтрагента = СсылкаСправочникаПользователи.СотрудникКонтрагента;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
