Процедура ПередЗаписью(Отказ)
	
	мин_ДатаНачалаПлановая     = Дата(1,1,1);
	макс_ДатаОкончанияПлановая = Дата(1,1,1);
	
	Для Каждого СтрокаТаблицы Из СоставПроекта Цикл
		
		Если мин_ДатаНачалаПлановая = Дата(1,1,1) ИЛИ мин_ДатаНачалаПлановая > СтрокаТаблицы.ДатаНачалаПлановая Тогда
			мин_ДатаНачалаПлановая = СтрокаТаблицы.ДатаНачалаПлановая;
		КонецЕсли;
		
		Если макс_ДатаОкончанияПлановая < СтрокаТаблицы.ДатаОкончанияПлановая Тогда
			макс_ДатаОкончанияПлановая = СтрокаТаблицы.ДатаОкончанияПлановая;
		КонецЕсли;
		
	КонецЦикла;  // Для Каждого СтрокаТаблицы Из СоставПроекта Цикл
	
	ДатаНачалаПлановая    = мин_ДатаНачалаПлановая;
	ДатаОкончанияПлановая = макс_ДатаОкончанияПлановая;	
	
КонецПроцедуры  // ПередЗаписью(Отказ)