
Процедура ОбработкаПроведения(Отказ, Режим)
	

	// регистр ОстаткиНаСкладах Приход
	Движения.ОстаткиНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыОборудование Из ТоварыОборудование Цикл
		Движение = Движения.ОстаткиНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = СкладНазначение;
		Движение.Номенклатура = ТекСтрокаТоварыОборудование.Номенклатура;
		Движение.Количество = ТекСтрокаТоварыОборудование.Количество;
	КонецЦикла;

	// регистр ОстаткиНаСкладах Расход
	Движения.ОстаткиНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыОборудование Из ТоварыОборудование Цикл
		Движение = Движения.ОстаткиНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладИсточник;
		Движение.Номенклатура = ТекСтрокаТоварыОборудование.Номенклатура;
		Движение.Количество = ТекСтрокаТоварыОборудование.Количество;
	КонецЦикла;

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиНаСкладахОстатки.Склад КАК Склад,
		|	ОстаткиНаСкладахОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И Номенклатура В (&Товары)) КАК ОстаткиНаСкладахОстатки
		|ГДЕ
		|	ОстаткиНаСкладахОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", СкладИсточник);
	Запрос.УстановитьПараметр("Товары", ТоварыОборудование.ВыгрузитьКолонку("Номенклатура"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("На складе " + ВыборкаДетальныеЗаписи.Склад+" не хватает	"+ ВыборкаДетальныеЗаписи.Номенклатура);
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры
