Функция GetByAnnotation(Annotation) Экспорт
	
	Результат = Справочники.witsml_Units.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	witsml_Units.Ссылка КАК Ссылка,
		|	witsml_Units.Код КАК Код
		|ИЗ
		|	Справочник.witsml_Units КАК witsml_Units
		|ГДЕ
		|	witsml_Units.Код = &Annotation";
	
	Запрос.УстановитьПараметр("Annotation", Annotation);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Код = Annotation Тогда
			Результат = Выборка.Ссылка;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;  // Пока Выборка.Следующий() Цикл
			
	Возврат Результат;
	
КонецФункции  // GetByAnnotation(Annotation) Экспорт