
&НаСервере
Процедура ПоказатьМестоположениеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМестоположение(Команда)
	
	МассивОбъектов = Новый Массив;
	
	Для каждого ОбъектОтображения Из Элементы.Список.ВыделенныеСтроки Цикл
	    МассивОбъектов.Добавить(ОбъектОтображения);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура("ОбъектыОтображения",МассивОбъектов);
	ОткрытьФорму("Обработка.ГеографическийМониторинг.Форма.Форма",ПараметрыОткрытия,ЭтотОбъект); 


КонецПроцедуры
